In [1]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt

In [2]:

data = pd.read_csv('StudentsPerformance.csv')
data

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33
...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,male,group E,bachelor's degree,standard,completed,100,100,100

# 1. Count of male and female students

In [3]:
d=data['gender'].value_counts()
d

female    518
male      482
Name: gender, dtype: int64

# 2. Educational qualification of parents

In [4]:
pe=data['parental level of education'].value_counts()
pe

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental level of education, dtype: int64

Most of the students parents have some college level of education followed by associate's degree and least parental  level of education is master's degree

# 3.who score the most

In [18]:
df=data.groupby(data['gender']).mean()
df

        math score  reading score  writing score
gender
female   63.376448      72.590734      72.467181
male     68.821577      65.545643      63.446058

In [19]:
df.max()

math score       68.821577
reading score    72.590734
writing score    72.467181
dtype: float64

from the above based on gender female score the most on average

In [24]:
avg=data.groupby(data['test preparation course']).mean()
avg

                         math score  reading score  writing score
test preparation course
completed                  69.96648      74.175978      74.684358
none                       63.78972      66.417445      64.457944

In [22]:
avg.max()

math score       69.966480
reading score    74.175978
writing score    74.684358
dtype: float64

from the above students who completed score the most on average

# 4.variation